# Домашнее задание номер 3 из урока 1 "Основы языка Python"
# Текст задания: Реализовать склонение слова «процент» для чисел до 20.
# Например, задаем число 5 — получаем «5 процентов», задаем число 2 — получаем «2 процента».
# Вывести все склонения для проверки.

percent = int(input('введите значение процента(1-20): '))

list1 = ["процент", "процента", "процента", "процента"]
for i in range(16):
    list1.append("процентов")

print(percent, list1[percent-1])
print('вывод для проверки склонения: ')
for i in range(1, 21):
    print(i, list1[i-1])