# Домашнее задание номер 2 из урока 1 "Основы языка Python"
# Текст задания:  Создать список, состоящий из кубов нечётных чисел от 1 до 1000:
# Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7.
# Например, число «19 ^ 3 = 6859» будем включать в сумму,
# так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7.
# Внимание: использовать только арифметические операции!
# К каждому элементу списка добавить 17
# и заново вычислить сумму тех чисел из этого
# списка, сумма цифр которых делится нацело на 7.
# * Решить задачу под пунктом b, не создавая новый список.


list_result = []
summ = 0
summ17 = 0
for i in range(1, 1000, 2):
    result = i**3
    list_result.append(result)

    summ_result = 0
    for ch in str(result):
        summ_result += int(ch)
    if summ_result % 7 == 0:
        summ += result

    summ_result17 = 0
    for ch in str(result + 17):
        summ_result17 += int(ch)
    if summ_result17 % 7 == 0:
        summ17 += result
        print(result, '-', summ_result, ":", result + 17, "-", summ_result17)